from datetime import datetime

import pytest


@pytest.fixture
def error_message() -> str:
    return "Неверный номер карты!"


@pytest.fixture
def error_data_message() -> str:
    return "Неверный формат даты!"


@pytest.fixture
def current_data() -> str:
    now_time = datetime.now()
    return str(now_time.isoformat())

@pytest.fixture(params=[
    (
        1,
        5,
        [
            "0000 0000 0000 0001",
            "0000 0000 0000 0002",
            "0000 0000 0000 0003",
            "0000 0000 0000 0004",
            "0000 0000 0000 0005",
        ],
    ),
    (100, 103, ["0000 0000 0000 0100",
                "0000 0000 0000 0101",
                "0000 0000 0000 0102",
                "0000 0000 0000 0103"]),
    # Если имеются начальные значения меньше минимального
    (
        -100,
        5,
        [
            "0000 0000 0000 0001",
            "0000 0000 0000 0002",
            "0000 0000 0000 0003",
            "0000 0000 0000 0004",
            "0000 0000 0000 0005",
        ],
    ),
    (
        1,
        -5,
        [
            "0000 0000 0000 0001",
        ],
    ),
    # Если значения находятся в пределах допуска
    (
        1432_4321_5678_7654,
        1432_4321_5678_7659,
        [
            "1432 4321 5678 7654",
            "1432 4321 5678 7655",
            "1432 4321 5678 7656",
            "1432 4321 5678 7657",
            "1432 4321 5678 7658",
            "1432 4321 5678 7659",
        ],
    ),
    # Если конечное значение выходит за предел допустимых значений
    (
        9999_9999_9999_9998,
        19999_4321_5678_7659,
        [
            "9999 9999 9999 9998",
            "9999 9999 9999 9999",
        ],
    ),
])
def valid_cards(request) -> int:
    return request.param
